artillery/test_local_nocache/upload_shorts.txt
Test run id: t7te6_yz38dh3tge5ed84nrdztaca5cwze4_34p7
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 21:26:07(+0000)

Mohammad10+b47c063f-f0b7-47ec-85ef-2a0cf19dafa7?token=1733693168362-CC80BE2CBE73EAE855B96A2C37A5D866
Trevor.Bahringer6+cb5c904a-1ad5-4519-9190-0a9ef4173262?token=1733693169344-CF552FB1254549A6B5A403E94D3FE135
Llewellyn.Schroeder+0282610b-9cdc-440a-8df4-2f2897f3d1df?token=1733693170343-F0898C5823341BD2F775E875E570D24F
Julian_Marquardt+6d615691-585a-49ce-8c9d-fddb64f1effd?token=1733693170406-16987117B821981EE31A948103E2CEF7
Alessia8+acba59c8-b16e-4b1a-9b2e-d7c6af830381?token=1733693171343-C3BCC4B2BDB768E5C9962B8E451A282A
Yessenia_Murphy90+01d9d23e-a0ef-4afa-bf31-2ebca72438f0?token=1733693171395-CA14520AC4480D17BC28B210DD08FE02
Marcel.Skiles+79efe4af-2076-4045-8c05-4b8eac0d641c?token=1733693172344-AB428FA90E71555F898093B820FE7CD6
Garrett.Koss78+0ac48677-65b7-4485-a8de-dc6e9bd2fec6?token=1733693172394-82142371A56BAA2CBD84554174A616C6
Alessia8+5e4f44ca-c863-4a02-906f-82359f19c11c?token=1733693172456-53BFC29F5E88A367CF2A83F66DDCE7F3
Cory60+85ff7e06-cf05-4d80-8479-6592c9b4cefd?token=1733693173345-60BE3A4567A6ABB5CF685A01AA212782
Sibyl_Tillman40+ffaac0cc-ab74-4f0a-9bcb-7b95182947df?token=1733693173396-A3C3DABB2E5D6EFAD7CF31F05DB46A5A
Wilson58+d51d2f42-c0a3-4fb9-b804-77a975408370?token=1733693173444-923ADA8D0A92AB7E60BBA12D9B051DD2
Yessenia_Murphy90+0afc122a-8939-4b5f-b4c2-95c60b91e486?token=1733693174345-9090D7B570BED62AA292F83806DCE0AE
Jason_Ferry48+9e9ca42d-bb1a-415e-9bff-4cc25b5f7b8d?token=1733693174396-AF07872E54239BF53D4E4BF43E930F82
Lesly_Runte88+cd23b563-dc5b-48fc-95eb-31871ad220b0?token=1733693174445-9AC9D509AF1E8AFB93C5DF06E5C94344
Wilson58+d3cc9f13-8977-42ca-b39e-7a00bb0d72e0?token=1733693174507-3F6E1D9A8003BC97A6D8F0C6446BF23F
Leo_Kuhlman6+c16a82d9-6a83-479b-b858-004f1550abc9?token=1733693175344-E3191B5B9DDF338F0E5B4B56D9E34984
Kaia_Legros62+de126541-af54-4f5c-9654-47f2de14f916?token=1733693175397-DA404C2C474DE915E448041F25D648FC
Veronica_Yundt+8f85fcfe-bf49-46c5-859e-b74b11d71680?token=1733693175445-B9FBB54849FFB44967830672ABAC2F19
Jodie52+a42dedbd-9046-4cf9-8d21-cb1e3aae7ad2?token=1733693175495-5E6F4CEA89C5AD46E4DD58524851469B
Estrella87+eee302c3-8d3a-4a15-9f35-0998f59ae947?token=1733693176344-ABB61B2C0A1CD2B4716830BB1BFC92FE
Trevor.Bahringer6+99f31ace-fcc1-4437-a29b-4fd7810cb725?token=1733693176395-DE4ECE4ED4FE59A52A82B86AB81CF013
Jennyfer.Leuschke89+a702b9e8-342d-4722-a2c0-21dcd1209d28?token=1733693176445-C0C51854FCB3019594674B19F2C65568
Marjory_Maggio+68414d7a-7f53-4a89-80db-4e03b8a7c9bc?token=1733693176495-D38927F0C4D9867827017F4EEB6E8F6A
Freida_Tremblay+7531f6f8-67de-408c-9444-523911445bbd?token=1733693176558-7CC8B6EFF6F0AC5D75FF5767AD49DF15
Phase completed: Warm up (index: 0, duration: 10s) 21:26:17(+0000)

Marianne_Lebsack65+7e41dfe4-d3ea-400d-956b-90d60aa4a89f?token=1733693177344-9360DDE801AC03A6C06D936D2C3D1862
Peyton_Konopelski84+1dda7554-ee31-405e-9f39-db9cf5eee8fb?token=1733693177396-E7807774C008C02AF06C8659E5C80038
Hildegard0+fbf73f78-648a-4484-b00e-f5e3fc7c7fa8?token=1733693177445-771AB48FA2968BC4AF3182D00D42F329
Sarina_Hartmann96+bd5ecf1e-a0db-4c3c-97ce-698c6e3c9b9f?token=1733693177495-638C64E7FE3194A8B93F266C5316BCC4
Waino.OConner+4cb59904-5288-4750-9a13-1f8d6cd39b75?token=1733693177546-24A8081B8F0671411BDB7984CC773047
--------------------------------------
Metrics for period to: 21:26:10(+0000) (width: 1.009s)
--------------------------------------

http.codes.200: ................................................................ 2
http.codes.204: ................................................................ 2
http.downloaded_bytes: ......................................................... 561
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 4
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 299
  mean: ........................................................................ 80.5
  median: ...................................................................... 5
  p95: ......................................................................... 15
  p99: ......................................................................... 15
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 299
  mean: ........................................................................ 80.5
  median: ...................................................................... 5
  p95: ......................................................................... 15
  p99: ......................................................................... 15
http.responses: ................................................................ 4
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 2
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 2
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 5
  max: ......................................................................... 299
  mean: ........................................................................ 152
  median: ...................................................................... 5
  p95: ......................................................................... 5
  p99: ......................................................................... 5
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 3
  max: ......................................................................... 15
  mean: ........................................................................ 9
  median: ...................................................................... 3
  p95: ......................................................................... 3
  p99: ......................................................................... 3
vusers.completed: .............................................................. 2
vusers.created: ................................................................ 2
vusers.created_by_name.Upload short: ........................................... 2
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11.6
  max: ......................................................................... 333.7
  mean: ........................................................................ 172.6
  median: ...................................................................... 11.6
  p95: ......................................................................... 11.6
  p99: ......................................................................... 11.6


--------------------------------------
Metrics for period to: 21:26:20(+0000) (width: 7.219s)
--------------------------------------

http.codes.200: ................................................................ 28
http.codes.204: ................................................................ 28
http.downloaded_bytes: ......................................................... 7839
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 56
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 46
  mean: ........................................................................ 8.5
  median: ...................................................................... 4
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 46
  mean: ........................................................................ 8.5
  median: ...................................................................... 4
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1
http.responses: ................................................................ 56
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 28
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 28
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 46
  mean: ........................................................................ 14.2
  median: ...................................................................... 6
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 5
  mean: ........................................................................ 2.8
  median: ...................................................................... 3
  p95: ......................................................................... 3
  p99: ......................................................................... 4
vusers.completed: .............................................................. 28
vusers.created: ................................................................ 28
vusers.created_by_name.Upload short: ........................................... 28
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10.5
  max: ......................................................................... 72.2
  mean: ........................................................................ 23.7
  median: ...................................................................... 13.6
  p95: ......................................................................... 54.1
  p99: ......................................................................... 55.2


All VUs finished. Total time: 11 seconds

--------------------------------
Summary report @ 21:26:19(+0000)
--------------------------------

http.codes.200: ................................................................ 30
http.codes.204: ................................................................ 30
http.downloaded_bytes: ......................................................... 8400
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 299
  mean: ........................................................................ 13.3
  median: ...................................................................... 4
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 299
  mean: ........................................................................ 13.3
  median: ...................................................................... 4
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1
http.responses: ................................................................ 60
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 30
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 30
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 299
  mean: ........................................................................ 23.4
  median: ...................................................................... 6
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 15
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 5
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Upload short: ........................................... 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10.5
  max: ......................................................................... 333.7
  mean: ........................................................................ 33.6
  median: ...................................................................... 13.6
  p95: ......................................................................... 55.2
  p99: ......................................................................... 71.5